package com.away1994.idlerest.loushi;

import com.away1994.idlerest.bean.Response;
import com.away1994.idlerest.config.BaseConfiguration;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RequestMethod;
import org.springframework.web.bind.annotation.RequestParam;
import org.springframework.web.bind.annotation.RestController;

import javax.servlet.http.HttpServletRequest;
import javax.servlet.http.HttpServletResponse;
import java.util.ArrayList;
import java.util.Comparator;


@RestController
public class LouShiController {

    public class LouShiInfo {
        public String id;
        public String title;

        public LouShiInfo(String id, String title) {
            this.id = id;
            this.title = title;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }
    }

    public class LouShiDetail {
        public String id;
        public String title;
        public String detail;

        public LouShiDetail(String id, String title, String detail) {
            this.id = id;
            this.title = title;
            this.detail = detail;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getDetail() {
            return detail;
        }

        public void setDetail(String detail) {
            this.detail = detail;
        }
    }

    class MyComparator2 implements Comparator<LouShiDetail> {
        @Override
        public int compare(LouShiDetail o1, LouShiDetail o2) {
            return o2.id.compareTo(o1.id);
        }
    }


    @Autowired
    private BaseConfiguration configuration;


    @RequestMapping(value = "/loushi/list", method = RequestMethod.GET)
    public Response list(@RequestParam(value = "detailID", defaultValue = "1") String detailID,
                         HttpServletResponse response, HttpServletRequest request) {


        ArrayList<LouShiDetail> arrayList = new ArrayList<>();
        arrayList.add(new LouShiDetail("1", "中天·珺府（截止6月2日）", "所在区域：临安\n登记时间：2018年5月29日—6月2日\n开盘房源：204套\n优先比例：20%\n开盘均价：15554元/㎡\n购买条件：60万现金存款证明\n主力户型：95方\n售楼电话：0571-61110000\n登记情况：待定\n摇号时间：待定\n中签率：待定"));
        arrayList.add(new LouShiDetail("1", "绿城九龙仓柳岸晓风（截止5月31日）", "所在区域：滨江区\n登记时间：2018年5月29日—5月31日\n开盘房源：50套\n优先比例：10%\n开盘均价：82270元/㎡（含8000元/㎡精装标准）\n购买条件：购房意向家庭需先在开发商指定的中国工商银行或中国交通银行或中国农业银行进行征信审核，并根据征信情况在该银行存入现金存款（根据最新住房贷款政策要求：无房且无贷款记录的客户，存款金额为500万；已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为1000万；一次性付款的客户，存款金额为1700万\n主力户型：173方的1套，约200方的4套，240-250方的36套，270-275方的9套\n售楼电话：0571-87119090\n登记情况：待定\n摇号时间：待定\n中签率：待定"));

        arrayList.add(new LouShiDetail("1", "华夏四季（截止5月27日）", "所在区域：余杭区未来科技城\n" +
                "登记时间：2018年5月25日—5月27日\n" +
                "开盘房源：160套\n" +
                "优先比例：40%\n" +
                "开盘均价：26105元/㎡（含5000元/㎡精装标准）\n" +
                "购买条件：无房无贷款记录：60万元现金存款证明；有房或有贷款记录：120万元现金存款证明；一次性付款：200万元现金存款证明\n" +
                "主力户型：89㎡、112㎡\n" +
                "售楼电话：0571-86129999\n\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定\n"));
        arrayList.add(new LouShiDetail("2", "阳光城·未来悦（截止5月27日）", "所在区域：余杭区未来科技城\n" +
                "登记时间：2018年5月25日—5月27日\n" +
                "开盘房源：103套\n" +
                "优先比例：30%\n" +
                "开盘均价：30000元/㎡\n" +
                "               （含3000元/㎡精装标准）\n" +
                "购买条件：无房无贷款记录：冻结100万元资金；有房或有贷款记录：冻结180万元资金；一次性付款：冻结300万元资金\n" +
                "主力户型：112㎡、125㎡\n" +
                "售楼电话：0571-89773333\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("3", "融信澜天（截止5月27日）\n", "所在区域：余杭区良渚\n" +
                "登记时间：2018年5月25日—5月27日\n" +
                "开盘房源：404套\n" +
                "优先比例：40%\n" +
                "开盘均价：18460.88元/㎡\n" +
                "购买条件：无房无贷款记录：冻结50万元资金；有房或有贷款记录：冻结100万元资金；一次性付款：冻结150万元资金\n" +
                "主力户型：83㎡、89㎡、109㎡、125㎡\n" +
                "售楼电话：0571-89005588\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定\n"));
        arrayList.add(new LouShiDetail("4", "中国铁建·西湖国际城（截止5月27日）", "所在区域：西湖区\n" +
                "登记时间：2018年5月25日—5月27日\n" +
                "开盘房源：150套\n" +
                "优先比例：25%\n" +
                "开盘均价：28080元/㎡\n" +
                "购买条件：无房无贷款记录：冻结100万元资金；有房或有贷款记录：冻结200万元资金；一次性付款：冻结330万元资金\n" +
                "主力户型：90-144㎡\n" +
                "售楼电话：0571-85880666\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("5", "万丽·璞丽（待定）", "所在区域：临平\n" +
                "登记时间：\n" +
                "开盘房源：40套\n" +
                "优先比例：15%\n" +
                "开盘均价：28000—38000元/㎡（含9800元/㎡精装标准）\n" +
                "购买条件：\n" +
                "主力户型：360-500㎡\n" +
                "售楼电话： 0571-86181166\n" +
                "\n" +
                "登记情况：\n" +
                "摇号时间：\n" +
                "中签率："));
        arrayList.add(new LouShiDetail("6", "融创·微风之城（截止5月26日）", "所在区域：富阳\n" +
                "登记时间：2018年5月24日—5月26日\n" +
                "开盘房源：36套\n" +
                "优先比例：15%\n" +
                "开盘均价：18000元/㎡\n" +
                "购买条件：无房且无贷款记录客户，存款金额为70万；已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为150万；一次性付款的客户，存款金额为250万\n" +
                "主力户型：147㎡、134㎡\n" +
                "售楼电话：0571-61797888\n" +
                "\n" +
                "登记情况：\n" +
                "摇号时间：5月29日\n" +
                "中签率：\n"));
        arrayList.add(new LouShiDetail("7", "融信·江南学府（截止5月27日）", "所在区域：萧山\n" +
                "登记时间：2018年5月22日-2018年5月26日\n" +
                "开盘房源：186套\n" +
                "优先比例：20 %\n" +
                "开盘均价：均价27400/㎡\n" +
                "主力户型：138㎡\n" +
                "购买条件：无房且无贷款记录客户，存款金额为100万；已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为210万；一次性付款的客户，存款金额为350万。\n" +
                "售楼电话：0571-88358888\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("8", "融创金成·十锦台（截止5月26日）", "所在区域：临安\n" +
                "登记时间：2018年5月22日-2018年5月26日\n" +
                "开盘房源：70套\n" +
                "优先比例：20 %\n" +
                "开盘均价：均价20600元/㎡（含3500元/㎡精装标准）\n" +
                "购买条件：60万元现金存款证明\n" +
                "售楼电话：0571-61116999\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("9", "滨江保利·翡翠海岸（截止5月23日）", "所在区域：上城区\n" +
                "登记时间：2018年5月21日-2018年5月23日\n" +
                "开盘房源：319套\n" +
                "优先比例：15 %\n" +
                "开盘均价：均价68000元/㎡（含精装标准6000元/㎡）\n" +
                "购买条件：200万现金存款证明\n" +
                "售楼电话：0571-87550111\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "万科·郡西澜山（截止5月27日）", "所在区域：余杭区\n" +
                "登记时间：2018年5月22日-2018年5月27日\n" +
                "开盘房源：167套\n" +
                "优先比例：30 %\n" +
                "开盘均价：均价23510元/㎡（含精装标准3000元/㎡）\n" +
                "购买条件：无房且无贷款记录的客户，存款金额为60万；其余情况120万\n" +
                "售楼电话：0571-4001178178\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "卓越·蔚蓝领秀（截止5月25日）", "所在区域：江干区\n" +
                "登记时间：2018年5月21日-2018年5月25日\n" +
                "开盘房源：384套\n" +
                "优先比例：30 %\n" +
                "开盘均价：均价19100-19500元/㎡\n" +
                "购买条件：无房且无贷款记录客户，存款金额为60万；已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为120万；一次性付款的客户，存款金额为160万。\n" +
                "主力户型：90——144㎡\n" +
                "售楼电话： 0571-86680088\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "璞丽东方（截止5月26日）", "所在区域：余杭\n" +
                "登记时间：2018年5月22日-2018年5月26日\n" +
                "开盘房源：236套 最后三幢\n" +
                "优先比例：40 %\n" +
                "开盘均价：均价23000-27200元/㎡\n" +
                "购买条件：90万现金存款证明\n" +
                "主力户型：89㎡、100㎡、114㎡、127㎡、129㎡、136㎡、143㎡\n" +
                "售楼电话：0571-86298666\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "旭辉东原·吴越府（截止5月26日）", "所在区域：临安\n" +
                "登记时间：2018年5月22日-2018年5月26日\n" +
                "开盘房源：236套\n" +
                "优先比例：20%\n" +
                "开盘均价：均价15984-26224元/㎡（高层、排屋）\n" +
                "购买条件：50万现金存款证明\n" +
                "主力户型：97㎡、129㎡\n" +
                "售楼电话：\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "北苑丽城（截止5月25日）", "所在区域：临安\n" +
                "登记时间：2018年5月21日-2018年5月25日\n" +
                "开盘房源：77套\n" +
                "优先比例：20%\n" +
                "开盘均价：均价14380元/㎡\n" +
                "购买条件：35万现金存款证明\n" +
                "主力户型：85㎡、86㎡、108㎡、125㎡\n" +
                "售楼电话：0571-61088666\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "苕溪壹号（截止5月25日）", "所在区域：临安\n" +
                "登记时间：2018年5月21日-2018年5月25日\n" +
                "开盘房源：136套\n" +
                "优先比例：20%\n" +
                "开盘均价：均价19185元/㎡\n" +
                "购买条件：50万现金存款证明\n" +
                "主力户型：143㎡\n" +
                "售楼电话：0571-63750571\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定\n"));
        arrayList.add(new LouShiDetail("1", "越秀·星汇城（截止5月25日）", "所在区域：临安\n" +
                "登记时间：2018年5月21日-2018年5月25日\n" +
                "开盘房源：464套\n" +
                "优先比例：20%\n" +
                "开盘均价：均价15492元/㎡\n" +
                "购买条件：50万现金存款证明\n" +
                "主力户型：89㎡、122㎡、\n" +
                "售楼电话：0571-61108888\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "融创金成·江南府（截止5月25日）", "所在区域：余杭\n" +
                "登记时间：2018年5月22日-2018年5月25日\n" +
                "开盘房源：138套\n" +
                "优先比例：30%\n" +
                "开盘均价：均价23360元/㎡ （含精装标准3500元/㎡）\n" +
                "购买条件：70万现金存款证明\n" +
                "主力户型：89㎡、136㎡\n" +
                "售楼电话：0571-85858899\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "湘湖壹号（ 截止5月25日）", "所在区域：萧山区\n" +
                "登记时间：2018年5月21日-2018年5月25日\n" +
                "开盘房源：72\n" +
                "优先比例：20%\n" +
                "开盘均价：均价49990元/㎡\n" +
                "购买条件：购房意向家庭需先在开发商指定的中国工商银行进行征信审核,根据征信情况在该银行开设个人账户,首套住房客户存入500万现金存款、二套住房客户存入1000万现金存款、并提供指定银行账户余额复印件,存期从登记日起,至开发商公证摇号房源公示结東后。若于公示结東日前存款余额首套住房客户低于500万、套住房客户低于1000万的,将取消摇号及选房资格\n" +
                "主力户型：390㎡—440㎡（含精装标准6000元/㎡）\n" +
                "售楼电话：0571-83836666\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "大江东宝龙广场（截止5月23日）", "所在区域：大江东\n" +
                "登记时间：2018年5月20日-2018年5月23日\n" +
                "开盘房源：134套\n" +
                "优先比例：30%\n" +
                "开盘均价：16200元/㎡(含精装修3000元/㎡)\n" +
                "购买条件：60万现金存款证明\n" +
                "主力户型：127㎡\n" +
                "售楼电话：0571-83725666\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "和昌·云栖玖著（天鸿·美和院 截止5月21日）", "所在区域：富阳\n" +
                "登记时间：2018年5月19日-2018年5月21日\n" +
                "开盘房源： 88套 高层\n" +
                "优先比例：30%\n" +
                "开盘均价：均价13868.66元/㎡\n" +
                "购买条件：客户需提供相应存款证明书（根据最新住房贷款政策要求：无房且无贷款记录的客户，存款金额为50万；\n" +
                "               已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为80万；\n" +
                "               一次性付款的客户，存款金额为150万）\n" +
                "主力户型：89㎡、114㎡\n" +
                "售楼电话： 0571-88880707\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定\n"));
        arrayList.add(new LouShiDetail("1", "绿城九龙仓·桂语江南(截止5月25日）", "所在区域：萧山\n" +
                "登记时间：2018年5月21日-2018年5月25日\n" +
                "开盘房源：100套\n" +
                "优先比例：30%\n" +
                "开盘均价：34000元/㎡（含精装标准4500元/㎡）\n" +
                "购买条件：无房且无贷款记录客户，存款金额为85万；已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为170万；一次性付款的客户，存款金额为284万\n" +
                "主力户型：95㎡、125㎡\n" +
                "售楼电话：0571-82959988\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "新城·香悦公馆 (截止5月24日）", "所在区域：萧山\n" +
                "登记时间： 2018年5月20日-2018年5月24日\n" +
                "开盘房源：129套\n" +
                "优先比例：30%\n" +
                "开盘均价：23337-24635元/㎡（含精装标准3000元/㎡）\n" +
                "购买条件：60万现金存款证明\n" +
                "主力户型：95㎡、125㎡\n" +
                "售楼电话：0571-22878888\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "远洋·雁归里(未开始登记）", "所在区域：萧山\n" +
                "登记时间：2018年5月20日—5月24日\n" +
                "开盘房源：29套\n" +
                "优先比例：20%\n" +
                "开盘均价：23750-30500元/㎡\n" +
                "购买条件：85万元现金存款证明\n" +
                "主力户型：125-179㎡\n" +
                "售楼电话：0571-88193377\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定\n"));
        arrayList.add(new LouShiDetail("1", "桃李春风 (领出预售证）", "所在区域：临安\n" +
                "登记时间：\n" +
                "开盘房源：114套\n" +
                "优先比例：\n" +
                "开盘均价：31054元/㎡\n" +
                "购买条件：50万现金存款证明\n" +
                "主力户型：51㎡、81㎡、82㎡\n" +
                "售楼电话：0571-61078188\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "旭辉·珺悦府（截止5月23日）", "所在区域：萧山\n" +
                "登记时间：2018年5月19日-2018年5月23日\n" +
                "开盘房源： 196套\n" +
                "优先比例：40%\n" +
                "开盘均价：23380元/㎡（含精装标准2300元/㎡） \n" +
                "\n" +
                "购买条件：验资证明需提供建设银行（潘水路支行）、工商银行(萧山分行营业部）、兴业银行（凤起支行）其中一家的存款证明，无房且无贷款记录的客户，存款金额为60万；已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为120万；一次性付款的客户，存款金额为200万。\n" +
                "主力户型：90㎡\n" +
                "售楼电话：0571-22678888 \n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定\n"));
        arrayList.add(new LouShiDetail("1", "阳光城·丽景湾（截止5月21日）", "所在区域：富阳\n" +
                "登记时间：2018年5月19日-2018年5月21日\n" +
                "开盘房源：44套叠墅\n" +
                "优先比例：30 %\n" +
                "开盘均价：25000元/㎡\n" +
                "购买条件：50万流动资金证明\n" +
                "主力户型：130㎡\n" +
                "售楼电话： 0571-87198808\n" +
                "\n" +
                "登记情况：183组（无房户68户，占比37%)\n" +
                "摇号时间：待定\n" +
                "中签率：24%\n"));
        arrayList.add(new LouShiDetail("1", "融信·萧山公馆（未开始登记）", "所在区域：萧山区\n" +
                "登记时间：\n" +
                "开盘房源：3# 38套\n" +
                "优先比例：10%\n" +
                "开盘均价：均价34000元/㎡ （含3500元/㎡精装标准） \n" +
                "\n" +
                "购买条件：无房且无贷款记录的客户，存款金额为130万\n" +
                "         已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为260万\n" +
                "         一次性付款的客户，存款金额为447万。\n" +
                "主力户型：156㎡、181㎡\n" +
                "售楼电话： 0571-82718888\n" +
                "\n" +
                "登记情况：待定\n" +
                "摇号时间：待定\n" +
                "中签率：待定"));
        arrayList.add(new LouShiDetail("1", "和昌·云栖玖著（截止5月17日）", "所在区域：富阳\n" +
                "登记时间：2018年5月15日-2018年5月17日10:00-18:00\n" +
                "开盘房源： 21套\n" +
                "优先比例：10%\n" +
                "开盘均价：均价23838.45元/㎡ \n" +
                "\n" +
                "购买条件：无房且无贷款记录的客户，存款金额为100万\n" +
                "          已拥有一套住房，或无住房但有住房贷款记录的客户，存款金额为200万；\n" +
                "          一次性付款的客户，存款金额为300万\n" +
                "主力户型：126㎡、139㎡、167㎡、195㎡ \n" +
                "售楼电话： 0571-88880707\n" +
                "\n" +
                "登记情况：129组家庭，无房户38户，占比29.5%\n" +
                "摇号时间：5月20日\n" +
                "中签率：16.3%"));
        arrayList.add(new LouShiDetail("1", "万科·竹径云山（截止5月17日）", "所在区域：余杭\n" +
                "登记时间：2018年5月15日-2018年5月17日10:00-18:00\n" +
                "开盘房源： 89套\n" +
                "优先比例：20%\n" +
                "开盘均价：均价23300-32078元/㎡（含3000-3500元/㎡精装标准） \n" +
                "\n" +
                "购买条件：80万元现金存款证明 \n" +
                "主力户型：120㎡、144㎡\n" +
                "售楼电话： 4001698698\n" +
                "\n" +
                "登记情况：1406组家庭，无房户484组，占比34.4%\n" +
                "摇号时间：5月21日\n" +
                "中签率：6.3%"));
        arrayList.add(new LouShiDetail("1", "万科·郡西云台（未开始登记）", "所在区域：余杭区\n" +
                "登记时间：\n" +
                "开盘房源：69号楼12套\n" +
                "优先比例：30%\n" +
                "开盘均价：45000-70000元/㎡（含6000元/㎡装修价）\n" +
                "\n" +
                "购买条件：250万现金存款证明\n" +
                "主力户型：200㎡、218㎡\n" +
                "售楼电话：4001078078\n" +
                "\n" +
                "登记情况：14组家庭，无房户1户，占比7.1%\n" +
                "摇号时间：5月22日\n" +
                "中签率：85.7%"));
        arrayList.add(new LouShiDetail("1", "阳光城·翡丽公园（截止5月19日）", "所在区域：萧山区\n" +
                "登记时间：2018年5月15日—5月19日\n" +
                "开盘房源：4、6号楼216套\n" +
                "优先比例：30%\n" +
                "开盘均价：18695-22205元/㎡（含3000元/㎡装修价）\n" +
                "\n" +
                "购买条件：50万现金存款证明\n" +
                "主力户型：89㎡、108㎡、125㎡\n" +
                "售楼电话：0571-85873333\n" +
                "\n" +
                "登记情况：5739组家庭，无房户2330组，占比40.6%\n" +
                "摇号时间：5月22日\n" +
                "中签率：3.8%"));
        arrayList.add(new LouShiDetail("1", "绿城·桃源小镇（截止5月19日）", "所在区域：余杭区\n" +
                "登记时间：2018年5月15日—5月19日\n" +
                "开盘房源：1、3、4号楼112套\n" +
                "优先比例：40%\n" +
                "开盘均价：18000-24000元/㎡\n" +
                "\n" +
                "购买条件：40万元现金存款证明\n" +
                "主力户型：65㎡、85㎡\n" +
                "售楼电话：0571-88690001\n" +
                "\n" +
                "登记情况：1331组家庭，无房户396组，占比29.8%摇号时间：5月22日中签率：8.4%"));
        arrayList.add(new LouShiDetail("1", "泰禾·杭州院子（未开始登记）", "所在区域：余杭区\n" +
                "登记时间：\n" +
                "开盘房源：8、20号楼17套 （179-649方）1、7、11、21号楼49套（150-192方）\n" +
                "优先比例：30%\n" +
                "开盘均价：54000-74000元/㎡（179-649方）及48000-53000元/㎡（150-192方）\n" +
                "\n" +
                "购买条件：\n" +
                "主力户型：179-649㎡、150-192㎡\n" +
                "售楼电话：0571-86891111\n" +
                "\n" +
                "登记情况：28组家庭\n" +
                "摇号时间：待定\n" +
                "中签率：100%"));
        return new Response(200, "success", arrayList);
    }



}
